package com.company;

public class Page2Excercise6 {
    public static void main(String[] args){

        for(int numbers = 2; numbers <= 100; numbers = numbers+2){
            System.out.println(numbers + "");
        }

    }
}
//6)Напишите программу вывода всех четных чисел от 2 до 100 Включительно