package com.company;

public class PageExcercise7 {
    public static void main(String[] args) {
        int odd, summa=0;

        for(odd = 1; odd <= 99; odd += 2)

                summa += odd;

        System.out.println("The sum of odd numbers is = " + summa);
    }
}


//7)Напишите программу, определяющую сумму всех нечетных чисел от 1 До 99